#include <iostream>
using namespace std;

int main() {
int m, n;

m = 5;
n = 5;
cout << "1) m + --n = " << m + --n << endl; // Результат первого выражения
cout << "m = " << m << ", n = " << n << endl; // Изменённые переменные 1 задания

m = 5;
n = 5;
cout << "2) m++ < ++n = " << (m++ < ++n) << endl; // Результат второго выражения
cout << "m = " << m << ", n = " << n << endl; // Изменённые переменные 2 задания

m = 5;
n = 5;
cout << "3) n-- < --m = " << (n-- < --m) << endl; // Результат третьего выражения
cout << "m = " << m << ", n = " << n << endl; // Изменённые переменные 3 задания

return 0;
}
